## # `Windbg` -

Here are a few structures and data types that you should become familiar with.To view them in WinDbg, use the `dt` command followed by their name :

|**Command**|**Description**|
|---|---|
|<mark style="background: #FFB86CA6;">\_EPROCESS</mark>|The executive process block|
|<mark style="background: #D2B3FFA6;">\_ETHREAD</mark>|The executive thread block|
|<mark style="background: #E632B3A6;">\_PEB</mark>|The process environment block|
|<mark style="background: #07E997A6;">\_TEB</mark>|The thread environment block|
|<mark style="background: #FF5582;">\_UNICODE_STRING</mark>|Structure for wide character strings|
|<mark style="background: #07E2E96E;">\_DRIVER_OBJECT</mark>|Structure for drivers|
|<mark style="background: #FF9255;">\_LIST_ENTRY</mark>|The linking component in doubly linked lists|
|<mark style="background: #FFB86CA6;">\_LARGE_INTEGER</mark>|Structure for 64-bit numbers|
|<mark style="background: #D2B3FFA6;">\_CLIENT_ID</mark>|Structure for process ID and thread ID pairs|
|<mark style="background: #E632B3A6;">\_POOL_HEADER</mark>|Structure that describes kernel pool allocations|
|<mark style="background: #07E997A6;">\_OBJECT_HEADER</mark>|Structure that describes kernel objects|
|<mark style="background: #FF5582;">\_FILE_OBJECT</mark>|Structure for file objects|
|<mark style="background: #07E2E96E;">\_CONTEXT</mark>|Structure that describes a thread’s state and registers|

## # `Dumping Data TEB` -

- <mark style="background: #3D7EFFA6;">Dumping structures using dt </mark> :

The `Display Type` ***dt*** command takes the name of the structure to display as an argument and, optionally, a memory address from which to dump the structure data. The structure needs to be provided by one of the loaded symbol files.

```c
0:000> dt ntdll!_TEB
 +0x000 NtTib : _NT_TIB
 +0x01c EnvironmentPointer : Ptr32 Void
 +0x020 ClientId : _CLIENT_ID
 +0x028 ActiveRpcHandle : Ptr32 Void
 +0x02c ThreadLocalStoragePointer : Ptr32 Void
 +0x030 ProcessEnvironmentBlock : Ptr32 _PEB
 +0x034 LastErrorValue : Uint4B
 +0x038 CountOfOwnedCriticalSections : Uint4B
 +0x03c CsrClientThread : Ptr32 Void
 ...
 +0xfe0 ResourceRetValue : Ptr32 Void
 +0xfe4 ReservedForWdf : Ptr32 Void
 +0xfe8 ReservedForCrt : Uint8B
 +0xff0 EffectiveContainerId : _GUID
```

For cases where a field points to a nested structure, the field data type is replaced by the correct sub-structure type. The substructure type can also be identified with an underscore (`_NT_TIB`) leading the field type, and the field type name in capital letters.

Notice that the `NtTib` field at offset 0x0 is a nested structure of type `_NT_TIB`.

By supplying the `-r` flag to the dt command, ==WinDbg will recursively display nested structures where present== :

```c
0:004> dt -r ntdll!_TEB @$teb
   +0x000 NtTib            : _NT_TIB
      +0x000 ExceptionList    : (null) 
      +0x008 StackBase        : 0x000000c9`3a080000 Void
      +0x010 StackLimit       : 0x000000c9`3a07c000 Void
      +0x018 SubSystemTib     : (null) 
      +0x020 FiberData        : 0x00000000`00001e00 Void
      +0x020 Version          : 0x1e00
      +0x028 ArbitraryUserPointer : (null) 
      +0x030 Self             : 0x000000c9`39e1b000 _NT_TIB
         +0x000 ExceptionList    : (null) 
         +0x008 StackBase        : 0x000000c9`3a080000 Void
         +0x010 StackLimit       : 0x000000c9`3a07c000 Void
         +0x018 SubSystemTib     : (null) 
         +0x020 FiberData        : 0x00000000`00001e00 Void
         +0x020 Version          : 0x1e00
         +0x028 ArbitraryUserPointer : (null) 
         +0x030 Self             : 0x000000c9`39e1b000 _NT_TIB
   +0x038 EnvironmentPointer : (null) 
   +0x040 ClientId         : _CLIENT_ID
      +0x000 UniqueProcess    : 0x00000000`000008a8 Void
      +0x008 UniqueThread     : 0x00000000`00002528 Void
   +0x050 ActiveRpcHandle  : (null) 
   +0x058 ThreadLocalStoragePointer : (null) 
   +0x060 ProcessEnvironmentBlock : 0x000000c9`39e0c000 _PEB
      +0x000 InheritedAddressSpace : 0 ''
      +0x001 ReadImageFileExecOptions : 0 ''
      +0x002 BeingDebugged    : 0x1 ''
      +0x003 BitField         : 0x84 ''
      +0x003 ImageUsesLargePages : 0y0
      +0x003 IsProtectedProcess : 0y0
      +0x003 IsImageDynamicallyRelocated : 0y1
      +0x003 SkipPatchingUser32Forwarders : 0y0
      +0x003 IsPackagedProcess : 0y0
      +0x003 IsAppContainer   : 0y0
      +0x003 IsProtectedProcessLight : 0y0
      +0x003 IsLongPathAwareProcess : 0y1
      +0x004 Padding0         : [4]  ""
      +0x008 Mutant           : 0xffffffff`ffffffff Void
      +0x010 ImageBaseAddress : 0x00007ff7`42490000 Void
      +0x018 Ldr              : 0x00007ffd`10f7c4c0 _PEB_LDR_DATA
         +0x000 Length           : 0x58
         +0x004 Initialized      : 0x1 ''
         +0x008 SsHandle         : (null) 
         +0x010 InLoadOrderModuleList : _LIST_ENTRY [ 0x00000219`fdc42bb0 - 0x00000219`fdc6fc80 ]
         +0x020 InMemoryOrderModuleList : _LIST_ENTRY [ 0x00000219`fdc42bc0 - 0x00000219`fdc6fc90 ]
         +0x030 InInitializationOrderModuleList : _LIST_ENTRY [ 0x00000219`fdc42a40 - 0x00000219`fdc6fca0 ]
         +0x040 EntryInProgress  : (null) 
         +0x048 ShutdownInProgress : 0 ''
         +0x050 ShutdownThreadId : (null)
         <SNIP>
```

We can also display specific fields in the structure by passing the name of the field as an additional parameter :

```c
0:004> dt ntdll!_TEB @$teb ThreadLocalStoragePointer
   +0x058 ThreadLocalStoragePointer : (null)
```

We can also use `sizeof` command to gather the size in bytes :

```c
0:004> ?? sizeof(ntdll!_TEB)
unsigned int64 0x1838
```

---

## # `Dumping Data PEB` -

- <mark style="background: #3D7EFFA6;">Dumping PEB Information</mark> :

```c
0:000> !peb
PEB at 000000937be38000
    InheritedAddressSpace:    No
    ReadImageFileExecOptions: No
    BeingDebugged:            Yes
    ImageBaseAddress:         00007ff742490000
    NtGlobalFlag:             70
    NtGlobalFlag2:            0
    Ldr                       00007ffd10f7c4c0
    Ldr.Initialized:          Yes
    Ldr.InInitializationOrderModuleList: 000001aa5fed2da0 . 000001aa5fede440
    Ldr.InLoadOrderModuleList:           000001aa5fed2f50 . 000001aa5fee4180
    Ldr.InMemoryOrderModuleList:         000001aa5fed2f60 . 000001aa5fee4190
                    Base TimeStamp                     Module
            7ff742490000 52b5327b Dec 21 11:47:31 2013 C:\Windows\System32\notepad.exe
            7ffd10e10000 feef31d3 Jul 15 13:42:03 2105 C:\WINDOWS\SYSTEM32\ntdll.dll
            7ffd0f510000 23c0ab5e Jan 03 16:45:42 1989 C:\WINDOWS\System32\KERNEL32.DLL
            7ffd0e820000 6b4de7c9 Jan 18 15:52:01 2027 C:\WINDOWS\System32\KERNELBASE.dll
            7ffd0b500000 9d68abf2 Sep 08 00:01:14 2053 C:\WINDOWS\SYSTEM32\apphelp.dll
            7ffd0f270000 7086f0b5 Oct 28 19:50:37 2029 C:\WINDOWS\System32\GDI32.dll
            7ffd0e6a0000 0dcd0213 May 04 01:56:59 1977 C:\WINDOWS\System32\win32u.dll
            7ffd0ebf0000 d31e9fa0 Mar 29 14:15:20 2082 C:\WINDOWS\System32\gdi32full.dll
            7ffd0eb50000 39255ccf May 19 20:55:03 2000 C:\WINDOWS\System32\msvcp_win.dll
            7ffd0e5a0000 2bd748bf Apr 23 07:09:11 1993 C:\WINDOWS\System32\ucrtbase.dll
            7ffd10ab0000 12e47419 Jan 17 18:26:57 1980 C:\WINDOWS\System32\USER32.dll
            7ffd101d0000 ab88b7a1 Mar 12 20:07:21 2061 C:\WINDOWS\System32\combase.dll
            7ffd0f330000 ed79d6e2 Apr 02 11:34:18 2096 C:\WINDOWS\System32\RPCRT4.dll
            7ffd0f180000 29534f79 Dec 21 19:58:09 1991 C:\WINDOWS\System32\shcore.dll
            7ffd0f810000 564f9f39 Nov 21 04:01:21 2015 C:\WINDOWS\System32\msvcrt.dll
            7ffcff0c0000 db2b08ef Jul 09 10:53:59 2086 C:\WINDOWS\WinSxS\amd64_microsoft.windows.common-controls_6595b64144ccf1df_6.0.19041.1110_none_60b5254171f9507e\COMCTL32.dll
            7ffd0f230000 68ff10be Oct 27 11:57:10 2025 C:\WINDOWS\System32\IMM32.DLL
    SubSystemData:     0000000000000000
    ProcessHeap:       000001aa5fed0000
    ProcessParameters: 000001aa5fed24b0
    CurrentDirectory:  'C:\WINDOWS\system32\'
    WindowTitle:  'C:\Windows\System32\notepad.exe'
    ImageFile:    'C:\Windows\System32\notepad.exe'
    CommandLine:  'C:\Windows\System32\notepad.exe'
    DllPath:      '< Name not readable >'
    Environment:  000001aa5fed1130
        ALLUSERSPROFILE=C:\ProgramData
        APPDATA=C:\Users\napst\AppData\Roaming
        CommonProgramFiles=C:\Program Files\Common Files
        CommonProgramFiles(x86)=C:\Program Files (x86)\Common Files
        CommonProgramW6432=C:\Program Files\Common Files
        COMPUTERNAME=NAPSTER
        ComSpec=C:\WINDOWS\system32\cmd.exe
        DBGENG_OVERRIDE_DBGSRV_PATH=C:\Users\napst\AppData\Local\Microsoft\WindowsApps\Microsoft.WinDbg_8wekyb3d8bbwe\dbgsrvX64.exe
        DBGHELP_HOMEDIR=C:\ProgramData\Dbg
        DriverData=C:\Windows\System32\Drivers\DriverData
        HOMEDRIVE=C:
        HOMEPATH=\Users\napst
        LOCALAPPDATA=C:\Users\napst\AppData\Local
        LOGONSERVER=\\NAPSTER
        NUMBER_OF_PROCESSORS=4
        OneDrive=C:\Users\napst\OneDrive
        OneDriveConsumer=C:\Users\napst\OneDrive
        OS=Windows_NT
        Path=C:\Program Files\WindowsApps\Microsoft.WinDbg_1.2308.2002.0_x64__8wekyb3d8bbwe\amd64;C:\Program Files (x86)\Common Files\Oracle\Java\javapath;C:\Program Files (x86)\Intel\Intel(R) Management Engine Components\iCLS\;C:\Program Files\Intel\Intel(R) Management Engine Components\iCLS\;C:\WINDOWS\system32;C:\WINDOWS;C:\WINDOWS\System32\Wbem;C:\WINDOWS\System32\WindowsPowerShell\v1.0\;C:\WINDOWS\System32\OpenSSH\;C:\Program Files (x86)\Intel\Intel(R) Management Engine Components\DAL;C:\Program Files\Intel\Intel(R) Management Engine Components\DAL;C:\Program Files (x86)\Intel\Intel(R) Management Engine Components\IPT;C:\Program Files\Intel\Intel(R) Management Engine Components\IPT;C:\Users\napst\AppData\Local\Programs\Python\Python37-32\Scripts\;C:\Users\napst\AppData\Local\Programs\Python\Python37-32\;C:\Users\napst\AppData\Local\Microsoft\WindowsApps
        PATHEXT=.COM;.EXE;.BAT;.CMD;.VBS;.VBE;.JS;.JSE;.WSF;.WSH;.MSC
        PROCESSOR_ARCHITECTURE=AMD64
        PROCESSOR_IDENTIFIER=Intel64 Family 6 Model 142 Stepping 9, GenuineIntel
        PROCESSOR_LEVEL=6
        PROCESSOR_REVISION=8e09
        ProgramData=C:\ProgramData
        ProgramFiles=C:\Program Files
        ProgramFiles(x86)=C:\Program Files (x86)
        ProgramW6432=C:\Program Files
        PSModulePath=C:\Program Files\WindowsPowerShell\Modules;C:\WINDOWS\system32\WindowsPowerShell\v1.0\Modules
        PT7HOME=C:\Program Files\Cisco Packet Tracer 7.2
        PUBLIC=C:\Users\Public
        QT_DEVICE_PIXEL_RATIO=auto
        SEE_MASK_NOZONECHECKS=1
        SRCSRV_SHOW_TF_PROMPT=1
        SystemDrive=C:
        SystemRoot=C:\WINDOWS
        TEMP=C:\Users\napst\AppData\Local\Temp
        TMP=C:\Users\napst\AppData\Local\Temp
        USERDOMAIN=NAPSTER
        USERDOMAIN_ROAMINGPROFILE=NAPSTER
        USERNAME=napst
        USERPROFILE=C:\Users\napst
        VBOX_MSI_INSTALL_PATH=C:\Program Files\Oracle\VirtualBox\
        windir=C:\WINDOWS
```

- <mark style="background: #FFB86CA6;">Dumping PEB structure using dt</mark> :

```c
0:000> dt ntdll!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
   +0x003 IsPackagedProcess : Pos 4, 1 Bit
   +0x003 IsAppContainer   : Pos 5, 1 Bit
   +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
   +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
   +0x004 Padding0         : [4] UChar
   +0x008 Mutant           : Ptr64 Void
   +0x010 ImageBaseAddress : Ptr64 Void
   +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
   +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
   +0x028 SubSystemData    : Ptr64 Void
   +0x030 ProcessHeap      : Ptr64 Void
   +0x038 FastPebLock      : Ptr64 _RTL_CRITICAL_SECTION
   +0x040 AtlThunkSListPtr : Ptr64 _SLIST_HEADER
   +0x048 IFEOKey          : Ptr64 Void
   +0x050 CrossProcessFlags : Uint4B
   +0x050 ProcessInJob     : Pos 0, 1 Bit
   +0x050 ProcessInitializing : Pos 1, 1 Bit
   +0x050 ProcessUsingVEH  : Pos 2, 1 Bit
   +0x050 ProcessUsingVCH  : Pos 3, 1 Bit
   +0x050 ProcessUsingFTH  : Pos 4, 1 Bit
   +0x050 ProcessPreviouslyThrottled : Pos 5, 1 Bit
   +0x050 ProcessCurrentlyThrottled : Pos 6, 1 Bit
   +0x050 ProcessImagesHotPatched : Pos 7, 1 Bit
   +0x050 ReservedBits0    : Pos 8, 24 Bits
   +0x054 Padding1         : [4] UChar
   +0x058 KernelCallbackTable : Ptr64 Void
   +0x058 UserSharedInfoPtr : Ptr64 Void
   +0x060 SystemReserved   : Uint4B
   +0x064 AtlThunkSListPtr32 : Uint4B
   +0x068 ApiSetMap        : Ptr64 Void
   +0x070 TlsExpansionCounter : Uint4B
   +0x074 Padding2         : [4] UChar
   +0x078 TlsBitmap        : Ptr64 Void
   +0x080 TlsBitmapBits    : [2] Uint4B
   +0x088 ReadOnlySharedMemoryBase : Ptr64 Void
   +0x090 SharedData       : Ptr64 Void
   +0x098 ReadOnlyStaticServerData : Ptr64 Ptr64 Void
   +0x0a0 AnsiCodePageData : Ptr64 Void
   +0x0a8 OemCodePageData  : Ptr64 Void
   +0x0b0 UnicodeCaseTableData : Ptr64 Void
   +0x0b8 NumberOfProcessors : Uint4B
   +0x0bc NtGlobalFlag     : Uint4B
   +0x0c0 CriticalSectionTimeout : _LARGE_INTEGER
   +0x0c8 HeapSegmentReserve : Uint8B
   +0x0d0 HeapSegmentCommit : Uint8B
   +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
   +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
   +0x0e8 NumberOfHeaps    : Uint4B
   +0x0ec MaximumNumberOfHeaps : Uint4B
   +0x0f0 ProcessHeaps     : Ptr64 Ptr64 Void
   +0x0f8 GdiSharedHandleTable : Ptr64 Void
   +0x100 ProcessStarterHelper : Ptr64 Void
   +0x108 GdiDCAttributeList : Uint4B
   +0x10c Padding3         : [4] UChar
   +0x110 LoaderLock       : Ptr64 _RTL_CRITICAL_SECTION
   +0x118 OSMajorVersion   : Uint4B
   +0x11c OSMinorVersion   : Uint4B
   +0x120 OSBuildNumber    : Uint2B
   +0x122 OSCSDVersion     : Uint2B
   +0x124 OSPlatformId     : Uint4B
   +0x128 ImageSubsystem   : Uint4B
   +0x12c ImageSubsystemMajorVersion : Uint4B
   +0x130 ImageSubsystemMinorVersion : Uint4B
   +0x134 Padding4         : [4] UChar
   +0x138 ActiveProcessAffinityMask : Uint8B
   +0x140 GdiHandleBuffer  : [60] Uint4B
   +0x230 PostProcessInitRoutine : Ptr64     void 
   +0x238 TlsExpansionBitmap : Ptr64 Void
   +0x240 TlsExpansionBitmapBits : [32] Uint4B
   +0x2c0 SessionId        : Uint4B
   +0x2c4 Padding5         : [4] UChar
   +0x2c8 AppCompatFlags   : _ULARGE_INTEGER
   +0x2d0 AppCompatFlagsUser : _ULARGE_INTEGER
   +0x2d8 pShimData        : Ptr64 Void
   +0x2e0 AppCompatInfo    : Ptr64 Void
   +0x2e8 CSDVersion       : _UNICODE_STRING
   +0x2f8 ActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x300 ProcessAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x308 SystemDefaultActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x310 SystemAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x318 MinimumStackCommit : Uint8B
   +0x320 SparePointers    : [4] Ptr64 Void
   +0x340 SpareUlongs      : [5] Uint4B
   +0x358 WerRegistrationData : Ptr64 Void
   +0x360 WerShipAssertPtr : Ptr64 Void
   +0x368 pUnused          : Ptr64 Void
   +0x370 pImageHeaderHash : Ptr64 Void
   +0x378 TracingFlags     : Uint4B
   +0x378 HeapTracingEnabled : Pos 0, 1 Bit
   +0x378 CritSecTracingEnabled : Pos 1, 1 Bit
   +0x378 LibLoaderTracingEnabled : Pos 2, 1 Bit
   +0x378 SpareTracingBits : Pos 3, 29 Bits
   +0x37c Padding6         : [4] UChar
   +0x380 CsrServerReadOnlySharedMemoryBase : Uint8B
   +0x388 TppWorkerpListLock : Uint8B
   +0x390 TppWorkerpList   : _LIST_ENTRY
   +0x3a0 WaitOnAddressHashTable : [128] Ptr64 Void
   +0x7a0 TelemetryCoverageHeader : Ptr64 Void
   +0x7a8 CloudFileFlags   : Uint4B
   +0x7ac CloudFileDiagFlags : Uint4B
   +0x7b0 PlaceholderCompatibilityMode : Char
   +0x7b1 PlaceholderCompatibilityModeReserved : [7] Char
   +0x7b8 LeapSecondData   : Ptr64 _LEAP_SECOND_DATA
   +0x7c0 LeapSecondFlags  : Uint4B
   +0x7c0 SixtySecondEnabled : Pos 0, 1 Bit
   +0x7c0 Reserved         : Pos 1, 31 Bits
   +0x7c4 NtGlobalFlag2    : Uint4B
```

Using `-r` for ==recursive dumping of nested structure== -

```c
0:000> dt -r3 ntdll!_PEB 000000937be38000
   +0x000 InheritedAddressSpace : 0 ''
   +0x001 ReadImageFileExecOptions : 0 ''
   +0x002 BeingDebugged    : 0x1 ''
   +0x003 BitField         : 0x4 ''
   +0x003 ImageUsesLargePages : 0y0
   +0x003 IsProtectedProcess : 0y0
   <SNIP>
   +0x018 Ldr              : 0x00007ffd`10f7c4c0 _PEB_LDR_DATA
      +0x000 Length           : 0x58
      +0x004 Initialized      : 0x1 ''
      +0x008 SsHandle         : (null) 
      +0x010 InLoadOrderModuleList : _LIST_ENTRY [ 0x000001aa`5fed2f50 - 0x000001aa`5fee4180 ]
         +0x000 Flink            : 0x000001aa`5fed2f50 _LIST_ENTRY [ 0x000001aa`5fed2d80 - 0x00007ffd`10f7c4d0 ]
            +0x000 Flink            : 0x000001aa`5fed2d80 _LIST_ENTRY [ 0x000001aa`5fed34a0 - 0x000001aa`5fed2f50 ]
            +0x008 Blink            : 0x00007ffd`10f7c4d0 _LIST_ENTRY [ 0x000001aa`5fed2f50 - 0x000001aa`5fee4180 ]
         +0x008 Blink            : 0x000001aa`5fee4180 _LIST_ENTRY [ 0x00007ffd`10f7c4d0 - 0x000001aa`5fede420 ]
            +0x000 Flink            : 0x00007ffd`10f7c4d0 _LIST_ENTRY [ 0x000001aa`5fed2f50 - 0x000001aa`5fee4180 ]
            +0x008 Blink            : 0x000001aa`5fede420 _LIST_ENTRY [ 0x000001aa`5fee4180 - 0x000001aa`5fedd930 ]
      +0x020 InMemoryOrderModuleList : _LIST_ENTRY [ 0x000001aa`5fed2f60 - 0x000001aa`5fee4190 ]
         +0x000 Flink            : 0x000001aa`5fed2f60 _LIST_ENTRY [ 0x000001aa`5fed2d90 - 0x00007ffd`10f7c4e0 ]
            +0x000 Flink            : 0x000001aa`5fed2d90 _LIST_ENTRY [ 0x000001aa`5fed34b0 - 0x000001aa`5fed2f60 ]
            +0x008 Blink            : 0x00007ffd`10f7c4e0 _LIST_ENTRY [ 0x000001aa`5fed2f60 - 0x000001aa`5fee4190 ]
         +0x008 Blink            : 0x000001aa`5fee4190 _LIST_ENTRY [ 0x00007ffd`10f7c4e0 - 0x000001aa`5fede430 ]
            +0x000 Flink            : 0x00007ffd`10f7c4e0 _LIST_ENTRY [ 0x000001aa`5fed2f60 - 0x000001aa`5fee4190 ]
            +0x008 Blink            : 0x000001aa`5fede430 _LIST_ENTRY [ 0x000001aa`5fee4190 - 0x000001aa`5fedd940 ]
      +0x030 InInitializationOrderModuleList : _LIST_ENTRY [ 0x000001aa`5fed2da0 - 0x000001aa`5fede440 ]
         +0x000 Flink            : 0x000001aa`5fed2da0 _LIST_ENTRY [ 0x000001aa`5fed3ba0 - 0x00007ffd`10f7c4f0 ]
            +0x000 Flink            : 0x000001aa`5fed3ba0 _LIST_ENTRY [ 0x000001aa`5fed34c0 - 0x000001aa`5fed2da0 ]
            +0x008 Blink            : 0x00007ffd`10f7c4f0 _LIST_ENTRY [ 0x000001aa`5fed2da0 - 0x000001aa`5fede440 ]
         +0x008 Blink            : 0x000001aa`5fede440 _LIST_ENTRY [ 0x00007ffd`10f7c4f0 - 0x000001aa`5fedd410 ]
            +0x000 Flink            : 0x00007ffd`10f7c4f0 _LIST_ENTRY [ 0x000001aa`5fed2da0 - 0x000001aa`5fede440 ]
            +0x008 Blink            : 0x000001aa`5fedd410 _LIST_ENTRY [ 0x000001aa`5fede440 - 0x000001aa`5fedd950 ]
      +0x040 EntryInProgress  : (null) 
      +0x048 ShutdownInProgress : 0 ''
      +0x050 ShutdownThreadId : (null)
      <SNIP>
     +0x038 CurrentDirectory : _CURDIR
         +0x000 DosPath          : _UNICODE_STRING "C:\WINDOWS\system32\"
            +0x000 Length           : 0x28
            +0x002 MaximumLength    : 0x208
            +0x008 Buffer           : 0x000001aa`5fed3150  "C:\WINDOWS\system32\"
         +0x010 Handle           : 0x00000000`00000044 Void  
```


## # `Dumping FLink/BLink(LIST_ENTRY) using dt` -

- <mark style="background: #3D7EFFA6;">Dumping processes from Windows Kernel</mark> : 

1. First we need Head of the List -

```c
kd> x nt!*activeprocess*
```

2. Dumping `ActiveProcessThread` from the above -

Pay attention to the first memory address

```c
dc nt!PsActiveProcessThread
```

3. Dump the type of the process i.e `EProcess` -

Pay attention to the Offset of `ActiveProcessLinks`

```c
dt nt!_EPROCESS
```

4. Dumping `ActiveProcess`  List Entry  -

```c
dt nt!_EPROCESS -l ActiveProcessLinks.Flink 88770628-0xe8
```

> `88770628` - Memory Address from 2nd step.
> `0xe8` - Offset of ActiveProcessLinks from 3rd step.

5. Filter out what you want to look for -

```c
dt nt!_EPROCESS -l ActiveProcessLinks.Flink -y Ima 88770628-0xe8
```

Will print field that only starts with Ima.

6. Displaying the NULL node -

There is a Null node in the above printed list.If you want to print or see the Null node(`Head Node`) use one of the ActiveProcessLinks starting pointer to dump the List and at the end of the List you will find a entry with null node which is the Head Node.

```c
ImageFilePointer : (null)
```

